{
  "Project": [
    {
      "PutRequest": {
        "Item": {
          "title": { "S": "Blog Market" },
          "description": {
            "S": "Developed a Blog app featuring a sleek user interface using React.js and Tailwind CSS. The frontend integrates seamlessly with a Node.js backend, utilizing Axios for API fetching and Multer for image storage. Implemented JWT for user authentication and session management. MongoDB Atlas is used for CRUD operations, including managing user credentials, blog posts, and comments. Enhanced security with Bcrypt for password encryption."
          },
          "techUsed": {
            "L": [
              { "S": "react" },
              { "S": "typescript" },
              { "S": "mongodb" },
              { "S": "tailwind" }
            ]
          },
          "projectLink": { "S": "https://github.com/SaagarRaj/React-BlogApp" },
          "DemoVideo": { "S": "https://www.youtube.com/watch?v=4Nw3wKFp2cM" }
        }
      }
    },
    {
      "PutRequest": {
        "Item": {
          "title": { "S": "Weather App" },
          "description": {
            "S": "Created a modern and responsive frontend using Next.js and React.js, optimized for various screen sizes. Utilized the Weather API to fetch real-time data including temperature, wind speed, humidity, and air pressure, with reliability ranging from 90% to 95%. Enhanced code maintainability and robustness through TypeScript."
          },
          "techUsed": {
            "L": [{ "S": "react" }, { "S": "typescript" }, { "S": "tailwind" }]
          },
          "projectLink": {
            "S": "https://github.com/SaagarRaj/Nextjs-WeatherApp"
          },
          "liveLink": { "S": "https://nextjs-weather-app-4s5k.vercel.app/" }
        }
      }
    },
    {
      "PutRequest": {
        "Item": {
          "title": { "S": "Evo Gym" },
          "description": {
            "S": "Developed a responsive landing page for a gym using React.js and TypeScript. Integrated engaging animations and interactive elements to boost user experience and visitor engagement. Utilized the react-hook-form library for efficient form handling and validation in the 'Contact Us' section, optimizing user input processing. Applied best practices in component-based architecture, state management, and responsive design to ensure a smooth and consistent user experience across devices and screen sizes."
          },
          "techUsed": {
            "L": [{ "S": "react" }, { "S": "javascript" }, { "S": "tailwind" }]
          },
          "projectLink": { "S": "https://github.com/SaagarRaj/gym-app" },
          "liveLink": { "S": "https://gym-app-five-beryl.vercel.app/" }
        }
      }
    },
    {
      "PutRequest": {
        "Item": {
          "title": { "S": "Tic-Tac-Toe" },
          "description": {
            "S": "Enhanced the Tic Tac Toe Web App with React.js and integrated Confetti.js to provide immersive animations, particularly celebrating player victories. This integration boosts user engagement and adds a fun, interactive element to the game."
          },
          "techUsed": {
            "L": [{ "S": "react" }, { "S": "javascript" }, { "S": "tailwind" }]
          },
          "projectLink": { "S": "https://github.com/SaagarRaj/TicTacToe" },
          "liveLink": { "S": "https://tic-tac-toe-seven-lemon.vercel.app/" }
        }
      }
    },
    {
      "PutRequest": {
        "Item": {
          "title": { "S": "BitTrade" },
          "description": {
            "S": "Led the development of BitTrade, a cryptocurrency market insights app, as part of a capstone project. Utilized the CoinMarketCap API to provide real-time market data. Implemented the MVVM (Model-View-View-Model) architecture for scalable design. Integrated Google Firebase for backend database management, user login/registration, transactional data, and user authorization. Optimized data fetching with the OkHttp package for real-time updates and accurate information retrieval."
          },
          "techUsed": { "L": [{ "S": "android" }] },
          "projectLink": { "S": "https://github.com/SaagarRaj/BitTrade" }
        }
      }
    },
    {
      "PutRequest": {
        "Item": {
          "title": { "S": "Sorting Visualizer" },
          "description": {
            "S": "Developed a Sorting Visualizer app to showcase various sorting algorithms (bubble, quick, merge, insertion, selection). Implemented the frontend using React and TypeScript, allowing users to visualize and interact with the sorting process. Added functionality for users to adjust the speed of the visualizer for a customized experience."
          },
          "techUsed": {
            "L": [{ "S": "react" }, { "S": "typescript" }, { "S": "tailwind" }]
          },
          "projectLink": {
            "S": "https://github.com/SaagarRaj/SortingVisualizer-NEXT"
          },
          "liveLink": {
            "S": "https://sorting-visualizer-next-beta.vercel.app/"
          }
        }
      }
    },
    {
      "PutRequest": {
        "Item": {
          "title": { "S": "Emotion Detection Model" },
          "description": {
            "S": "Developed an emotion detection model trained on the CIFAR-100 dataset, achieving an accuracy of 83.97%. This notable performance secured the 3rd position on the Papers with Code CIFAR-100 leaderboard. The model's high accuracy was achieved without using any additional training datasets, demonstrating its effectiveness in emotion classification within the CIFAR-100 framework."
          },
          "techUsed": { "L": [{ "S": "python" }] },
          "projectLink": {
            "S": "https://github.com/SaagarRaj/Emotion-Detection-FER13"
          }
        }
      }
    }
  ]
}
